Project/Toir.Adaptation/src/Catalogs/торо_ТиповыеОР/торо_ТиповыеОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d2263b10-6e57-46cf-b47e-55d2a0ece65c">
  <name>торо_ТиповыеОР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Направление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаборСвойствОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a539d3d0-780d-4225-9a49-5758a63c542a">
    <name>гкс_Модель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>НормативныеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>УчитыватьПростоиОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Статус</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НормативныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособПланирования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГрафикРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособУчетаДатыОтсчета</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеУчаствуетВПланировании</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеУчитыватьПродолжительность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗамещаемыеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗамещаемыйВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособЗамещения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НачальнаяГраница</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КонечнаяГраница</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запчасти</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Качество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредшествующиеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПредшествующийВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормативныеЗатратыПриТОиР</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОграниченияНаХарактеристикиОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="3c1c3c2d-feea-4d32-8161-3307cc6b0663">
    <name>гкс_КонструктивныйСостав</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="fe3986cf-990b-463d-b2d8-8fbd42506576">
      <name>Компонент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir.Adaptation/src/CommonModules/торо_Локализация/Module.bsl
#Область СлужебныеПроцедурыИФункции

&Вместо("ОбработкаПолученияПредставленияОбработкаПолученияПредставления")
Процедура Расш_гкс_ОбработкаПолученияПредставленияОбработкаПолученияПредставления(Источник, Данные, Представление, СтандартнаяОбработка)

	// Аннотация &Вместо в данном случае используется специально, чтобы не зависеть от кода процедуры в основной конфигурации
	// Процедуру нужно удалить из расширения, после успешного тестирования задачи "TOIR20-756" на прод базе
	
	Возврат;
	
	Если Данные.Свойство("Ссылка") = Ложь Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	
	Язык = торо_ОбщегоНазначенияПовтИсп.ТекущийЯзыкИБ();

	Ссылка = Данные.Ссылка;
	ТипСсылки = ТипЗнч(Ссылка);
	
	Если ТипСсылки = Тип("СправочникСсылка.торо_ТиповыеОР") Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(торо_Переводы.Текст, """") КАК Текст,
		|	торо_Переводы.Реквизит КАК Реквизит,
		|	ВЫБОР
		|		КОГДА торо_ТиповыеОР.ЭтоГруппа
		|			ТОГДА торо_ТиповыеОР.Наименование
		|		ИНАЧЕ торо_ТиповыеОР.гкс_Модель
		|	КОНЕЦ КАК Текст2
		|ИЗ
		|	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_Переводы КАК торо_Переводы
		|		ПО (торо_Переводы.ID = торо_ТиповыеОР.Ссылка)
		|			И (торо_Переводы.Язык = &Язык)
		|			И (торо_Переводы.Реквизит = ""Наименование""
		|					И торо_ТиповыеОР.ЭтоГруппа
		|				ИЛИ торо_Переводы.Реквизит = ""гкс_Модель""
		|					И торо_ТиповыеОР.ЭтоГруппа = ЛОЖЬ)
		|ГДЕ
		|	торо_ТиповыеОР.Ссылка = &ID";	
		Запрос.УстановитьПараметр("ID", Ссылка);
		Запрос.УстановитьПараметр("Язык", Язык);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Представление = ?(ЗначениеЗаполнено(Выборка.Текст),Выборка.Текст,Выборка.Текст2);
		КонецЕсли;
		Возврат;
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.гкс_ТехническиеМеста") Тогда 
		Возврат
		// гкс+ [11.22] Деснол 29.11.2022
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда 
		Если Константы.гкс_ОтключитьМногоязычностьОР.Получить() Тогда 
			СтандартнаяОбработка = Истина;
			Возврат;
		КонецЕсли;
		// гкс- [11.22] Деснол 29.11.2022
	КонецЕсли;

	ФорматнаяСтрока = Неопределено;
	Если ТипСсылки = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда 
		ФорматнаяСтрока = торо_РаботаСПользовательскимПредставлениемПовтИсп.ПолучитьФорматнуюСтроку("Справочники.торо_ОбъектыРемонта");
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.гкс_ТехническиеМеста") Тогда 
		ФорматнаяСтрока = СтрРазделить("НаименованиеПолное", "");
	КонецЕсли;

	СписокПолей = ?(ФорматнаяСтрока = Неопределено, 
	СтрРазделить("Наименование", ""), 
	торо_РаботаСПользовательскимПредставлением.ПолучитьСписокПолей(ФорматнаяСтрока));

	Запрос = Новый Запрос;
	#Область ТекстЗапроса
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_Переводы.Текст КАК Текст,
	|	торо_Переводы.Реквизит КАК Реквизит
	|ИЗ
	|	РегистрСведений.торо_Переводы КАК торо_Переводы
	|ГДЕ
	|	торо_Переводы.ID = &ID
	|	И торо_Переводы.Язык = &Язык
	|	И торо_Переводы.Реквизит В (&Реквизит)";
	#КонецОбласти 

	Запрос.УстановитьПараметр("ID", Ссылка);
	Запрос.УстановитьПараметр("Язык", Язык);
	Запрос.УстановитьПараметр("Реквизит", СписокПолей);
	Результаты = Запрос.Выполнить().Выгрузить();

	Переводы = Новый Структура;
	Для каждого Результат Из Результаты Цикл
		Переводы.Вставить(Результат.Реквизит, Результат.Текст);
	КонецЦикла; 

	Для каждого Поле Из СписокПолей Цикл
		Если Не Переводы.Свойство(Поле) Тогда
			Переводы.Вставить(Поле, Ссылка[Поле]);
		КонецЕсли; 
	КонецЦикла; 

	Представление = ?(ФорматнаяСтрока = Неопределено, 
	Переводы["Наименование"],
	торо_РаботаСПользовательскимПредставлением.ПолучитьПредставлениеПоФорматнойСтроке(ФорматнаяСтрока,Переводы));
	
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПолученияДанныхВыбораОбработкаПолученияДанныхВыбора")
Процедура Расш_гкс_ОбработкаПолученияДанныхВыбораОбработкаПолученияДанныхВыбора(Источник, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Возврат;
	#Вставка
	Если Не торо_ОбщегоНазначенияПовтИсп.ЭтоЯзыкПоУмолчанию() Тогда
	#КонецВставки
	#Удаление
	Если Не ЭтоЯзыкПоУмолчанию() Тогда
	#КонецУдаления
		Слова = СтрРазделить(Источник, ".");
		Тип = Слова[0];
		ОбъектИБ = Слова[1];
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;

		Если Тип = "СправочникМенеджер" Тогда
			Запрос = Новый Запрос;
			#Область ТекстЗапроса
			Запрос.Текст = СтрШаблон(
			"ВЫБРАТЬ
			|	СправочникИБ.Ссылка КАК Ссылка,
			|	торо_Переводы.Текст КАК Представление
			|ИЗ
			|	РегистрСведений.торо_Переводы КАК торо_Переводы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.%1 КАК СправочникИБ
			|		ПО торо_Переводы.ID = СправочникИБ.Ссылка
			|			И (торо_Переводы.Реквизит = ""Наименование"")
			|			И (торо_Переводы.Язык.Код = &Язык)
			|ГДЕ
			|	торо_Переводы.Текст ПОДОБНО &Наименование", ОбъектИБ);
			#КонецОбласти 

			Запрос.УстановитьПараметр("Язык", ТекущийЯзык().КодЯзыка);
			Запрос.УстановитьПараметр("Наименование", "%" + Параметры.СтрокаПоиска + "%");
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();

			Пока Выборка.Следующий() Цикл
				ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПолученияФормыОбработкаПолученияФормы")
Процедура Расш_гкс_ОбработкаПолученияФормыОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Возврат;
	#Вставка
	Если Не торо_ОбщегоНазначенияПовтИсп.ЭтоЯзыкПоУмолчанию() Тогда
	#КонецВставки
	#Удаление
	Если Не ЭтоЯзыкПоУмолчанию() Тогда
	#КонецУдаления
		Если ЭтоПользовательскаяФорма(Источник, ВидФормы) Тогда
			Возврат;
		КонецЕсли;

		Параметры.Вставить("ВидФормы", ВидФормы);

		Если ВидФормы = "ФормаОбъекта" Тогда
			#Область ФормаОбъекта
			СтандартнаяОбработка = Ложь;
			ДополнительнаяИнформация.ПовторноеИспользование = Истина;
			ВыбраннаяФорма = "ОбщаяФорма.торо_Автоформа";

			Ключ = Неопределено;
			Если Параметры.Свойство("Ключ", Ключ) Тогда
				Параметры.Вставить("Ключ", Ключ.ПолучитьОбъект());
			Иначе
				МетаданныеИсточника = ПолучитьМетаданныеИсточника(Источник);
				ТипОбъектаИБ = МетаданныеИсточника.ТипОбъектаИБ;
				ТипМетаданных = МетаданныеИсточника.ТипМетаданных;

				Если ТипМетаданных = "Справочники" Тогда
					НовыйЭлемент = Справочники[ТипОбъектаИБ].СоздатьЭлемент();
				ИначеЕсли ТипМетаданных = "Документы" Тогда
					НовыйЭлемент = Документы[ТипОбъектаИБ].СоздатьДокумент();
				КонецЕсли;

				Параметры.Вставить("Ключ", НовыйЭлемент);
			КонецЕсли; 
			#КонецОбласти 
		ИначеЕсли ВидФормы = "ФормаСписка" ИЛИ ВидФормы = "ФормаВыбора" Тогда
			#Область ФормаСписка
			МетаданныеИсточника = ПолучитьМетаданныеИсточника(Источник);
			ТипОбъектаИБ = МетаданныеИсточника.ТипОбъектаИБ;
			ТипМетаданных = МетаданныеИсточника.ТипМетаданных;
			Если СтрНайти(ТипМетаданных,"Документ") = 0 И СтрНайти(ТипМетаданных,"Справочник") = 0 Тогда 
				Возврат;
			ИначеЕсли СтрНайти(ТипМетаданных,"Регистр") > 0 Тогда 
				Возврат;
			КонецЕсли;
			Параметры.Вставить("ТипОбъектаИБ", ТипОбъектаИБ);
			Параметры.Вставить("ТипМетаданных", ТипМетаданных);

			СтандартнаяОбработка = Ложь;
			ДополнительнаяИнформация.ПовторноеИспользование = Истина;
			ВыбраннаяФорма = "ОбщаяФорма.торо_Автоформа";
			#КонецОбласти 
		ИначеЕсли ВидФормы = "ФормаЗаписи" Тогда
			#Область ФормаЗаписи
			Возврат;
			МетаданныеИсточника = ПолучитьМетаданныеИсточника(Источник);
			ТипОбъектаИБ = МетаданныеИсточника.ТипОбъектаИБ;
			ТипМетаданных = МетаданныеИсточника.ТипМетаданных;
			МассивИзмерений = Новый Массив();
			МассивРесурсов = Новый Массив();
			МассивРеквизитов = Новый Массив();
			Параметры.Вставить("ТипМетаданных", ТипМетаданных);

			Если ТипМетаданных = "РегистрыСведений" Тогда
				НовыйЭлемент = РегистрыСведений[ТипОбъектаИБ].СоздатьМенеджерЗаписи();
			Иначе
				Возврат;
			КонецЕсли;

			СтандартнаяОбработка = Ложь;
			ДополнительнаяИнформация.ПовторноеИспользование = Истина;
			ВыбраннаяФорма = "ОбщаяФорма.торо_Автоформа";

			Для Каждого Измерение Из Метаданные[ТипМетаданных][ТипОбъектаИБ].Измерения Цикл
				МассивИзмерений.Добавить(Измерение.Имя);
			КонецЦикла;
			Для Каждого Измерение Из Метаданные[ТипМетаданных][ТипОбъектаИБ].Ресурсы Цикл
				МассивРесурсов.Добавить(Измерение.Имя);
			КонецЦикла;
			Для Каждого Измерение Из Метаданные[ТипМетаданных][ТипОбъектаИБ].Реквизиты Цикл
				МассивРесурсов.Добавить(Измерение.Имя);
			КонецЦикла;
			Параметры.Вставить("МассивИзмерений", МассивИзмерений);
			Параметры.Вставить("МассивРесурсов", МассивРесурсов);
			Параметры.Вставить("МассивРеквизитов", МассивРеквизитов);
			Параметры.Вставить("ТипОбъектаИБ", ТипОбъектаИБ);

			Ключ = Неопределено;
			Если Параметры.Свойство("Ключ", Ключ) Тогда
				Если Не ТипЗнч(Ключ.Регистратор) = Тип("Неопределено") Тогда 
					НовыйЭлемент.Регистратор = Ключ.Регистратор;
				Иначе
					Для Каждого Измерение Из МассивИзмерений Цикл
						НовыйЭлемент[Измерение] = Ключ[Измерение];
					КонецЦикла;
				КонецЕсли;
				НовыйЭлемент.Прочитать();
				Параметры.Вставить("Ключ", НовыйЭлемент);
			Иначе
				Параметры.Вставить("Ключ", НовыйЭлемент);
			КонецЕсли;
			#КонецОбласти 
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти
